ASAO-KYOICHI/SVC_RCL_PG/tmpm380_CCONT.c
/**
 *題名：SVCの冷却工程アプリ
 *作成者：浅尾　享一
 *SVCの冷却作業を行うアプリケーション
**/

#include "tmpm380_CCONT.h"

void CCONT(void)
{
    OS_TSKCon1 *OS_LoadTime;/* OS設定値を読むためのポインタ構造体に名前をつける */
    OS_LoadTime = OSTSKCon1S();/* 関数経由でポインタをOSparamにアクセス */
    
    uint32_t REG_00, REG_01 = 0;/* 計算用 */
    uint16_t REG_02 = 0;
    
    if ( ((STSFL0 & 0x02) == 0) || (((STSFL0 & 0x02) > 0) && (TNO > 0)) ) {
        /* 初期化未完了か、初期化完了後ｾﾙﾌﾃｽﾄ中である場合 */
        OS_LoadTime->NEXT_LOAD_Time[3] = 100;/* 次回呼び出し時間 */
        OS_LoadTime->TSK_COND[3] = 0xA0;/* 遅延フラグ建築 */
        
        return;
        
    }
    
    if (((MXOTN0 & 0x01) > 0) && ((MXINO0 & 0x10) > 0)) {
        /* 常温真空弁がONで、常温真空弁閉リミットがONである場合 */
        CCTM3++;/* 真空弁の監視タイマをインクリメント */
        if (CCTM3 >= 250) {
            /* 25秒経過した場合 */
            CCTM3 = 0;/* タイマクリア */
            if (((ABNF & 0x0F) == 0)
            || (((SYSFLG & 0x02) > 0) && ((ABNF & 0x0F) == 8))
            || (((SYSFLG & 0x02) > 0) && ((ABNF & 0x0F) == 9))
            || (((SYSFLG & 0x02) > 0) && ((ABNF & 0x0F) == 14))) {
                /* 異常発生なしか、運転中で常温槽水槽水位電極棒異常である、
                または運転中で常温槽温度センサー異常か、運転中で真空度異常である場合 */
                ABNF &= 0x30;/* MASK */
                ABNF |= 0x86;/* ブザーフラグセット、電動弁異常セット */
                
            }
            
        }
        
    } else {
        /* 常温真空弁がOFFか、常温真空弁閉リミットがOFFである場合 */
        CCTM3 = 0;/* 監視タイマクリア */
        
    }
    
    if ( ((SYSFLG & 0x02) == 0)
    || (((SYSFLG & 0x02) > 0) && ((ABNF & 0x0F) > 0) && ((ABNF & 0x0F) != 8) && ((ABNF & 0x0F) != 9)
        && ((ABNF & 0x0F) != 14)) ) {
        /* 運転停止中である、又は運転中で常温槽水位電極棒異常ではく、常温槽温度センサー異常ではなく、真空度異常ではない場合 */
        STSFL1 &= 0x7F;/* 真空解除中のアラーム要求FLAGをリセット */
        STSFL0 &= 0xF7;/* 完了アラーム出力中フラグをリセット */
        
        if ((RPAT & 0x20) > 0) {
            /* 洗浄モードである場合 */
            CCLEAN();
            
        } else {
            /* 洗浄モードでない場合 */
            RPAT &= 0xDF;/* 洗浄モードフラグを強制OFF */
            CCSEQ = 0;/* 冷却シーケンスをクリア */
            CCTM0 = CCTM1 = CCTM2 = CCTM4 = 0;/* 冷却シーケンスタイマをクリア */
            CSEQTS = 0;/* 冷却時間をクリア */
            CSEQTM = 0;/* 冷却時間をクリア */
            
            if ((SYSFLG & 0x40) == 0) {
                /* 電源OFFである場合 */
                CCTM3 = 0;/* 常温真空弁監視用タイマをクリア */
                MXOTN0 &= 0xF0;/* 低温常温エジェクタ―Pオフ、低温常温真空弁をオフ */
                MXOTN1 &= 0x80;/* 真空破壊弁、徐冷弁、低温常温エジェクタ―弁をオフ */
                MXOTN2 &= 0xAF;/* 熱交循環Pと熱交排水弁をオフ */
                
            } else {
                /* 電源ONである場合 */
                MXOTN0 &= 0xF1;/* 低温常温エジェクタ―Pオフ、低温真空弁をオフ */
                MXOTN0 |= 0x01;/* 常温真空弁をオンにする */
                MXOTN1 &= 0x82;/* 真空破壊弁、徐冷弁、低温常温エジェクタ―弁をオフ */
                MXOTN1 |= 0x02;/* 冷却槽排水弁（予備）をオン */
                MXOTN2 &= 0xAF;/* 熱交循環Pと熱交排水弁をオフ */
                
            }
            
        }
        
    } else {
        /* 運転ONである場合 */
        /* 運転動作中 */
        if ((STSFL0 & 0x20) == 0) {
            /* 瞬停からの準備中である場合 */
            OS_LoadTime->NEXT_LOAD_Time[3] = 0;/* 次回呼び出し時間0ms */
            OS_LoadTime->TSK_COND[3] = 0x80;/* 遅延フラグ建築はそのまま */
            
            return;
            
        }
        
        if (CCTM0 >= 10) {
            /* 1秒経過した場合 */
            CCTM0 -= 10;/* 1秒を減算する */
            CSEQTS++;/* シーケンスタイマーをインクリメント */
            
            if (CSEQTS >= 60) {
                /* 60秒経過した場合 */
                CSEQTS = 0;/* 秒をクリアする */
                CSEQTM++;/* +1分する */
                
                if (CCSEQ != 15) {
                    /* 冷却完了待機でない場合 */
                    RTIMM++;/* 設備稼働時間+1分 */
                    if (RTIMM >= 60) {
                        /* 60分経過した場合 */
                        RTIMM = 0;/* クリア */
                        REG_00 = (uint32_t)RTIMH1;
                        REG_00 |= ((uint32_t)RTIMH2 << 8);
                        REG_00++;/* 時をインクリメント */
                        
                        if (REG_00 >= 60000) {
                            /* 60000時間以上になる場合 */
                            REG_00 = 60000;/* MAX FIX */
                            
                        }
                        RTIMH1 = (uint16_t)REG_00;/* 下位セット */
                        RTIMH2 = (uint16_t)(REG_00 >> 8);/* 上位セット */
                        
                    }
                    
                }/* 冷却完了待機である場合はここに抜ける */
                
                if (CSEQTM >= 200) {
                    /* 200分以上になる場合 */
                    CSEQTM = 200;/* MAX FIX */
                    
                }
                
            }/* 60秒経過していない場合はここに抜ける */
            
        }/* 1秒経過していない場合はここに抜ける */
        
        if (CCSEQ == 0) {
            /* 運転開始直後である場合 */
            MXOTN0 &= 0xF5;/* 低温エジェクタ―P、低温真空弁をオフにする */
            MXOTN0 |= 0x05;/* 常温エジェクタ―P、常温真空弁をオンにする */
            MXOTN1 &= 0xB6;/* 蒸気弁、低温エジェクタ弁をオフにする */
            MXOTN1 |= 0x36;/* 真空破壊弁、徐冷弁、常温エジェクタ弁、冷却総排水弁をオンにする */
            
            DSPNO = 3;/* 画面番号3にする */
            DSPSEQ = 0;/* クリアディスプレーシーケンス */
            
            SYSFLG &= 0xE3;/* 工程フラグクリア */
            SYSFLG |= 0x04;/* 徐冷工程をセット */
            CCSEQ = 1;/* 徐冷シーケンスにする */
            
            REG_00 = 1;/* 初期値クリア */
            REG_00 <<= NPAT;/* パターン数だけシフト */
            if (((uint8_t)REG_00 & RPAT) == 0) {
                /* 徐冷なしである場合 */
                MXOTN1 &= 0xAF;/* 蒸気弁、徐冷弁をオフ */
                SYSFLG &= 0xFB;/* 徐冷行程をリセット */
                SYSFLG |= 0x08;/* 冷却工程をセット */
                CCSEQ = 2;/* 冷却シーケンスをセット */
                
            }
            
        } else if (CCSEQ == 1) {
            /* 徐冷シーケンスである場合 */
            MXOTN0 &= 0xF0;/* 一旦クリア */
            MXOTN0 |= 0x05;/* 常温エジェクタPと常温真空弁をONにする */
            MXOTN1 &= 0x80;/* 一旦クリア */
            MXOTN1 |= 0x36;/* 真空破壊弁、徐冷弁、常温エジェクタ弁、冷却槽排水弁をONにする */
            
