ASAO-KYOICHI/SVC_RCL_PG/tmpm380_CCONT.c
            if (NPAT == 0) {
                /* パターン1である場合 */
                REG_00 = (uint32_t)SCTM1;
                
            } else if (NPAT == 1) {
                /* パターン2である場合 */
                REG_00 = (uint32_t)SCTM2;
                
            } else if (NPAT == 2) {
                /* パターン3である場合 */
                REG_00 = (uint32_t)SCTM3;
                
            } else {
                /* パターン4である場合 */
                REG_00 = (uint32_t)SCTM4;
                
            }
            
            if (CSEQTM >= (uint8_t)REG_00) {
                /* 徐冷時間経過した場合 */
                STSFL0 |= 0x40;/* クリックフラグをセット */
                MXOTN1 &= 0xAF;/* 蒸気弁、徐冷弁をオフにする */
                SYSFLG &= 0xFB;/* 徐冷行程をリセットする */
                SYSFLG |= 0x08;/* 冷却工程にする */
                CCSEQ = 2;/* 冷却シーケンスをセットする */
                
                if ((STSFL0 & 0x80) == 0) {
                    /* 設定中でない場合 */
                    DSPSEQ = 0;/* 画面シーケンスをクリアする */
                    
                }
                
            }
            
        } else if (CCSEQ < 10) {
            /* 真空解除工程未満である場合 */
            REG_00 = 1;/* 初期値クリア */
            REG_00 <<= NPAT;/* パターン数だけシフト */
            if (((uint8_t)REG_00 & RPAT) == 0) {
                /* 徐冷なしである場合 */
                REG_00 = 0;/* クリア */
                
            } else {
                /* 徐冷有りである場合 */
                if (NPAT == 0) {
                    /* パターン1である場合 */
                    REG_00 = (uint32_t)SCTM1;/* 徐冷時間1セット */
                    
                } else if (NPAT == 1) {
                    /* パターン2である場合 */
                    REG_00 = (uint32_t)SCTM2;/* 徐冷時間2セット */
                    
                } else if (NPAT == 2) {
                    /* パターン3である場合 */
                    REG_00 = (uint32_t)SCTM3;/* 徐冷時間3セット */
                    
                } else {
                    /* パターン4である場合 */
                    REG_00 = (uint32_t)SCTM4;/* 徐冷時間4セット */
                    
                }
                
            }
            
            if ((CSEQTM >= (uint8_t)(REG_00 + 5)) && (CSEQTS == 0)
            && ((MXINO0 & 0x40) == 0) && ((ABNF & 0x0F) == 0)) {
                /* 工程に入ってジャスト5分であり、真空圧力の入力が無く、異常が発生していない場合 */
                ABNF &= 0x30;/* マスクセット */
                ABNF |= 14;/* 真空度異常をセット */
                ABNF |= 0x40;/* 運転継続の異常セット */
                
            }
            
            if (CSEQTM >= (uint8_t)(REG_00 + 2)) {
                /* 2分経過した場合（2分未満は品温センサ不感時間） */
                if (NPAT == 0) {
                    /* パターン1である場合 */
                    REG_01 = (uint32_t)PAT1;/* 設定温度1セット */
                    
                } else if (NPAT == 1) {
                    /* パターン2である場合 */
                    REG_01 = (uint32_t)PAT2;/* 設定温度2セット */
                    
                } else if (NPAT == 2) {
                    /* パターン3である場合 */
                    REG_01 = (uint32_t)PAT3;/* 設定温度3セット */
                    
                } else {
                    /* パターン4である場合 */
                    REG_01 = (uint32_t)PAT4;/* 設定温度4セット */
                    
                }
                
                if (TMPDT0 <= (short)REG_01) {
                    /* 品温が設定温度以下になった場合 */
                    if ((CCSEQ == 3) || (CCSEQ >= 7)) {
                        /* 工程が常温槽冷却中である場合、又は低温槽冷却に切り替え後である場合 */
                        if (((SYKND0 & 0x10) == 0) && (CCSEQ < 4)) {
                            /* チラー式で、常温槽冷却工程が完了していない場合 */
                            if (TMPDT2 <= (short)SWTMP0) {
                                /* 設定温度以下になっている場合 */
                                SYSFLG |= 0x01;/* 常温排水をセット */
                                
                            }
                            
                        }
                        
                        DSPNO = 4;/* 冷却完了表示をセットする */
                        CCSEQ = 10;/* 真空解除工程をセット */
                        SYSFLG &= 0xE3;/* マスク */
                        SYSFLG |= 0x10;/* 冷却完了をセット */
                        
                        if ((STSFL0 & 0x80) == 0) {
                            /* 設定中では無い場合 */
                            DSPSEQ = 0;/* 表示シーケンスをクリア */
                            
                        }
                        
//                        REG_01 = (uint32_t)RTCDT[1];/* 分情報をセット */
//                        REG_02 = (uint16_t)REG_01;/* コピー */
//                        REG_01 /= 10;/* 4ビットシフト */
//                        REG_01 <<= 4;/* 10の位セット */
//                        REG_02 %= 10;/* 1の位セット */
//                        REG_01 |= REG_02;/* 組み合わせてBCD作る */
//                        ETIME1 = REG_01;/* 冷却完了時刻（分）セット */
                        ETIME1 = RTCDT[1];/* 冷却完了時刻（分）セット */
                        
//                        REG_01 = (uint32_t)RTCDT[2];/* 時情報をセット */
//                        REG_02 = (uint16_t)REG_01;/* コピー */
//                        REG_01 /= 10;/* 4ビットシフト */
//                        REG_01 <<= 4;/* 10の位セット */
//                        REG_02 %= 10;/* 1の位セット */
//                        REG_01 |= REG_02;/* 組み合わせてBCD作る */
//                        ETIME2 = REG_01;/* 冷却完了時刻（時）セット */
                        ETIME2 = RTCDT[2];/* 冷却完了時刻（時）セット */
                        
                    }
                    
                }/* 品温が設定温度超である場合はここに抜ける */
                
            }/* 品温センサの不感時間が経過していない場合はここに抜ける */
            
            if (CCSEQ == 2) {
                /* 常温冷却シーケンスである場合 */
                /* 常温槽による冷却工程 */
                MXOTN0 &= 0xF0;/* いったんMASK */
                MXOTN0 |= 0x05;/* 常温エジェクタP、常温真空弁をオン */
                MXOTN1 &= 0x80;/* 一旦MASK */
                MXOTN1 |= 0x26;/* 真空破壊弁、常温エジェクタ弁、冷却槽排水弁をオン */
                
                if (CSEQTM >= (uint8_t)(REG_00 + 1)) {
                    /* 1分経過した場合 */
                    CCSEQ = 3;/* 熱交換器給水起動制御をセット */
                    
