ASAO-KYOICHI/SVC_RCL_PG/tmpm380_CCONT.c
                }
                
            } else if (CCSEQ == 3) {
                /* 熱交換器給水起動制御の場合 */
                MXOTN0 &= 0xF0;/* MASK */
                MXOTN0 |= 0x05;/* 常温エジェクタP、常温真空弁をオン */
                MXOTN1 &= 0x80;/* 一旦MASK */
                MXOTN1 |= 0x26;/* 真空破壊弁、常温エジェクタ弁、冷却槽排水弁をオン */
                MXOTN2 &= 0xAF;/* MASK */
                MXOTN2 |= 0x10;/* 熱交排水弁をON */
                
                REG_02 = 0;/* 一旦クリア */
                
                if ((SYKND0 & 0x10) > 0) {
                    /* 蒸気式である場合 */
                    REG_02 = 5;/* 蒸気エジェクターの起動遅延時間分の5分をセット */
                    
                } else if ((SYKND0 & 0xC0) == 0x40) {
                    /* 50Rである場合 */
                    REG_02 = 4;/* 2槽式切り替え遅延時間の4分をセット */
                    
                } else if ((SYKND0 & 0xC0) == 0x80) {
                    /* 100Rである場合 */
                    if ((SYKND0 & 0x20) > 0) {
                        /* 15℃仕様の場合 */
                        REG_02 = 5;/* 15℃仕様用に5分セット */
                        
                    } else {
                        /* 10℃仕様の場合 */
                        REG_02 = 3;/* 10℃は2槽式切り替え遅延時間に3分をセット */
                        
                    }
                    
                } else {
                    /* 35Rである場合 */
                    if ((SYKND0 & 0x20) > 0) {
                        /* 15℃仕様の場合 */
                        REG_02 = 4;/* 15℃仕様用に4分セット */
                        
                    } else {
                        /* 10℃仕様の場合 */
                        REG_02 = 9;/* 10℃は2槽式切り替え遅延時間に9分をセット */
                        
                    }
                    
                }
                
                if (CSEQTM >= (uint8_t)(REG_00 + (uint32_t)REG_02)) {
                    /* 2槽式切り替え遅延時間を終了した場合 */
                    MXOTN0 &= 0xFE;/* 常温真空弁をオフにする */
                    CCTM1 = 0;/* 常温真空弁閉リミット検知タイマをクリアする */
                    CCSEQ = 4;/* 常温真空弁閉リミット検知工程をセットする */
                    
                }
                
            } else if (CCSEQ == 4) {
                /* 常温真空弁閉リミット検知工程 */
                MXOTN0 &= 0xF0;/* MASK */
                MXOTN0 |= 0x04;/* 常温エジェクタPをオン */
                MXOTN1 &= 0x80;/* 一旦MASK */
                MXOTN1 |= 0x26;/* 真空破壊弁、常温エジェクタ弁、冷却槽排水弁をオン */
                MXOTN2 &= 0xAF;/* MASK */
                MXOTN2 |= 0x10;/* 熱交排水弁をON */
                
                if ((MXINO0 & 0x10) == 0) {
                    /* 常温真空弁閉リミットを検知していない場合 */
                    CCTM1++;/* タイマをインクリメント */
                    if (CCTM1 >= 250) {
                        /* 25秒経過した場合 */
                        ABNF &= 0x30;/* MASK */
                        ABNF |= 0x86;/* ブザーフラグと電動弁異常をセットする */
                        
                    }
                    
                } else {
                    /* 常温真空弁の閉リミットを検知した場合 */
                    if ((SYKND0 & 0x10) == 0) {
                        /* チラー式である場合 */
                        MXOTN0 &= 0xF0;/* MASK */
                        MXOTN1 &= 0x80;/* 一旦MASK */
                        MXOTN1 |= 0x2A;/* 真空破壊弁、低温エジェクタ弁、冷却槽排水弁をオン */
                        MXOTN2 &= 0xAF;/* MASK */
                        MXOTN2 |= 0x10;/* 熱交排水弁をON */
                        
                        CCTM1 = 0;/* 2秒遅延タイマをクリア */
                        CCSEQ = 5;/* 2秒遅延工程をセットする */
                        
                        if (TMPDT2 > (short)SWTMP0) {
                            /* 常温槽水温が設定温度超である場合 */
                            SYSFLG |= 0x01;/* 常温排水工程要求フラグセット */
                            
                        }
                        
                    } else {
                        /* 蒸気式である場合 */
                        MXOTN0 &= 0xF0;/* MASK */
                        MXOTN0 |= 0x04;/* 常温エジェクタPをオン */
                        MXOTN1 &= 0xC0;/* 一旦MASK */
                        MXOTN1 |= 0x6E;/* 蒸気弁、真空破壊弁、蒸気弁2（低温エジェクタ弁）、常温エジェクタ弁、冷却槽排水弁をオン */
                        MXOTN2 &= 0xAF;/* MASK */
                        MXOTN2 |= 0x10;/* 熱交排水弁をON */
                        
                        CCSEQ = 8;/* 冷却最終工程 */
                    }
                    
                }
                
            } else if (CCSEQ == 5) {
                /* 2秒遅延工程である場合 */
                MXOTN0 &= 0xF0;/* MASK */
                MXOTN1 &= 0x80;/* 一旦MASK */
                MXOTN1 |= 0x2A;/* 真空破壊弁、低温エジェクタ弁、冷却槽排水弁をオン */
                MXOTN2 &= 0xAF;/* MASK */
                MXOTN2 |= 0x10;/* 熱交排水弁をON */
                
                CCTM1++;/* タイマーインクリメント */
                if (CCTM1 >= 20) {
                    /* 2秒経過した場合 */
                    MXOTN0 &= 0xF0;/* MASK */
                    MXOTN0 |= 0x08;/* 低温エジェクタ―PをON */
                    MXOTN1 &= 0x80;/* 一旦MASK */
                    MXOTN1 |= 0x2A;/* 真空破壊弁、低温エジェクタ弁、冷却槽排水弁をオン */
                    MXOTN2 &= 0xAF;/* MASK */
                    MXOTN2 |= 0x10;/* 熱交排水弁をON */
                    
                    CCTM1 = 0;/* 2秒遅延タイマをクリア */
                    CCSEQ = 6;/* 真空弁開までの遅延工程をセット */
                    
                }
                
            } else if (CCSEQ == 6) {
                /* 真空弁開までの遅延工程である場合 */
                MXOTN0 &= 0xF0;/* MASK */
                MXOTN0 |= 0x08;/* 低温エジェクタ―PをON */
                MXOTN1 &= 0x80;/* 一旦MASK */
                MXOTN1 |= 0x2A;/* 真空破壊弁、低温エジェクタ弁、冷却槽排水弁をオン */
                MXOTN2 &= 0xAF;/* MASK */
                MXOTN2 |= 0x10;/* 熱交排水弁をON */
                
                CCTM1++;/* タイマーをインクリメント */
                if (CCTM1 >= 40) {
                    /* 4秒経過した場合 */
                    MXOTN0 &= 0xF0;/* MASK */
                    MXOTN0 |= 0x0A;/* 低温エジェクタ―P、低温真空弁をON */
                    MXOTN1 &= 0x80;/* 一旦MASK */
                    MXOTN1 |= 0x2A;/* 真空破壊弁、低温エジェクタ弁、冷却槽排水弁をオン */
                    MXOTN2 &= 0xAF;/* MASK */
                    MXOTN2 |= 0x10;/* 熱交排水弁をON */
                    
                    CCTM2 = 0;/* 熱交循環帰りの制御タイマをクリア */
                    CCSEQ = 7;/* 熱交循環帰りの制御工程セット */
                    
