ASAO-KYOICHI/SVC_RCL_PG/tmpm380_CCONT.c
                }
                
            } else if ((CCSEQ == 7) && ((SYSFLG & 0x10) == 0)) {
                /* 熱交循環帰りの制御工程（冷却未完了）である場合 */
                MXOTN0 &= 0xF0;/* MASK */
                MXOTN0 |= 0x0A;/* 低温エジェクタ―P、低温真空弁をON */
                MXOTN1 &= 0x80;/* 一旦MASK */
                MXOTN1 |= 0x2A;/* 真空破壊弁、低温エジェクタ弁、冷却槽排水弁をオン */
                MXOTN2 &= 0xAF;/* MASK */
                MXOTN2 |= 0x10;/* 熱交排水弁をON */
                
                CCTM2++;/* タイマインクリメント */
                if (CCTM2 >= 600) {
                    /* 60秒経過した場合 */
                    MXOTN0 &= 0xF0;/* MASK */
                    MXOTN0 |= 0x0A;/* 低温エジェクタ―P、低温真空弁をON */
                    MXOTN1 &= 0x80;/* 一旦MASK */
                    MXOTN1 |= 0x2A;/* 真空破壊弁、低温エジェクタ弁、冷却槽排水弁をオン */
                    MXOTN2 &= 0xAF;/* MASK */
                    MXOTN2 |= 0x40;/* 熱交循環帰りをON */
                    
                    CCSEQ = 8;/* 冷却最終工程をセット */
                    CCTM1 = 0;/* 冷却工程タイマ1クリア */
                    CCTM2 = 0;/* 冷却工程タイマ2クリア */
                    
                }
                
            } else if (((CCSEQ == 7) && ((SYSFLG & 0x10) > 0)) || (CCSEQ == 8)) {
                /* 熱交循環帰りの工程(冷却完了）又は冷却最終工程である場合 */
                if (CCSEQ == 7) {
                    /* 7のままであった場合 */
                    CCSEQ = 8;/* 8に更新 */
                    
                }
                
                if ((SYKND0 & 0x40) > 0) {
                    /* 蒸気式である場合 */
                    MXOTN0 &= 0xF0;/* MASK */
                    MXOTN0 |= 0x04;/* 常温エジェクタ―PをON */
                    MXOTN1 &= 0x80;/* 一旦MASK */
                    MXOTN1 |= 0x6E;/* 蒸気弁、真空破壊弁、低温エジェクタ弁(蒸気弁2)、常温エジェクタ弁、冷却槽排水弁をオン */
                    MXOTN2 &= 0xAF;/* MASK */
                    MXOTN2 |= 0x10;/* 熱交排水弁をON */
                    
                } else {
                    /* チラー式である場合 */
                    MXOTN0 &= 0xF0;/* MASK */
                    MXOTN0 |= 0x0A;/* 低温エジェクタ―P、低温真空弁をON */
                    MXOTN1 &= 0x80;/* 一旦MASK */
                    MXOTN1 |= 0x2A;/* 真空破壊弁、低温エジェクタ弁、冷却槽排水弁をオン */
                    MXOTN2 &= 0xAF;/* MASK */
                    MXOTN2 |= 0x40;/* 熱交循環帰りをON */
                    
                }
                
                REG_02 = 0;/* 一旦クリア */
                REG_02 = (uint16_t)(CSEQTM - (uint8_t)REG_00);/* 現在の工程時間（分） - 徐冷時間を求める */
                /* 徐冷を除く、これまでの工程時間がこれで求める */
                
                if ((SYKND0 & 0xC0) == 0xC0) {
                    /* 40Rである場合 */
                    if (REG_02 >= 50) {
                        /* 冷却時間が50分経過している場合 */
                        ABNF &= 0x30;
                        ABNF |= 0x84;/* ブザーフラグON、冷却異常にする */
                        
                    }
                    
                } else {
                    /* 50～100R、35Rの場合 */
                    if (REG_02 >= 30) {
                        /* 冷却時間が30分経過している場合 */
                        ABNF &= 0x30;
                        ABNF |= 0x84;/* ブザーフラグON、冷却異常にする */
                        
                    }
                    
                }
                
            }
            /* 真空解除工程未満である場合　ここまで */
            
        } else if (CCSEQ == 10) {
            /* 真空解除工程直後の工程である場合 */
            if ((STSFL1 & 0x40) == 0) {
                /* 真空解除工程中のアラーム出力が禁止である場合 */
                STSFL1 |= 0x80;/* 真空解除中のアラーム要求フラグセット */
                
            }
            
            STSFL1 &= 0xBF;/* アラーム出力禁止フラグをクリア */
            CCTM5 = 0;/* 真空解除中のアラーム出力用タイマをクリアする */
            
            if ((SYKND0 & 0x10) > 0) {
                /* 蒸気式である場合 */
                MXOTN0 &= 0xF4;/* 常温・低温真空弁をクリア */
                MXOTN1 &= 0x82;/* クーリングタワー運転信号・冷却槽排水弁以外クリア */
                MXOTN2 &= 0xAF;/* 熱交排水、熱交循環をクリア */
                
            } else {
                /* チラー式である場合 */
                MXOTN0 &= 0xFC;/* 常温・低温真空弁をクリア */
                MXOTN1 &= 0xAE;/* 蒸気弁、徐冷弁をクリア */
                MXOTN2 &= 0xAF;/* 熱交排水、熱交循環をクリア */
                
            }
            
            CCSEQ = 11;/* 真空破壊弁制御開始までの遅延工程をセット */
            CCTM1 = 0;/* タイマクリア */
            CCTM2 = 0;/* タイマクリア */
            
            if ((STSFL0 & 0x80) == 0) {
                /* 設定中ではない場合 */
                DSPSEQ = 0;/* 画面表示シーケンスをクリア */
                
            }
            
            ABNF &= 0xBF;/* 継続異常の警報アラーム出力をリセット */
            if ((STSFL1 & 0x80) > 0) {
                /* 真空解除中のアラーム出力要求がある場合 */
                CCTM5++;/* インクリメント */
                if ((CCTM5 >= 6) || ((CCTM5 & 0x01) == 0)) {
                    /* 0.6秒以上か、偶数である場合 */
                    STSFL0 &= 0xF7;/* アラーム出力中フラグをオフにする */
                    TSB_PC_DATA_PC2 = 0;/* ブザークリア */
                    MXOTN2 &= 0x7F;/* 外部警報出力をクリア */
                    
                } else {
                    /* 0.6秒未満かつ奇数である場合 */
                    STSFL0 |= 0x08;/* アラーム出力中フラグをオンにする */
                    TSB_PC_DATA_PC2 = 1;/* ブザーオン */
                    MXOTN2 |= 0x80;/* 外部警報出力をオン */
                    
                }
                
                if (CCTM5 >= 30) {
                    /* 3秒以上になった場合 */
                    CCTM5 = 0;/* クリアする */
                    
                }
                
            }
            
        } else if (CCSEQ == 11) {
            /* 真空破壊工程までの遅延工程である場合 */
            CCTM2++;/* タイマインクリメント */
            CCTM1++;/* タイマインクリメント */
            
            if ((SYKND0 & 0x10) > 0) {
                /* 蒸気式である場合 */
                if (CCTM1 >= 100) {
                    /* 10秒以上になった場合 */
                    MXOTN0 &= 0xF0;/* 常温エジェクタポンプをOFFにする */
                    CCSEQ = 13;/* 常温真空弁開遅延工程をセット */
                    CCTM1 = 0;/* タイマクリア */
                    
                }
                
            } else {
                /* チラー式である場合 */
                if (CCTM1 >= 150) {
                    /* 15秒以上になった場合 */
                    MXOTN1 &= 0x82;/* 蒸気弁、真空破壊弁、徐冷弁、常温・低温エジェクタ弁をOFFにする */
                    CCSEQ = 12;/* ポンプ停止遅延工程をセット */
                    
