ASAO-KYOICHI/SVC_RCL_PG/tmpm380_CCONT.c
                }
                
            }
            
            ABNF &= 0xBF;/* 継続異常の警報アラーム出力をリセット */
            if ((STSFL1 & 0x80) > 0) {
                /* 真空解除中のアラーム出力要求がある場合 */
                CCTM5++;/* インクリメント */
                if ((CCTM5 >= 6) || ((CCTM5 & 0x01) == 0)) {
                    /* 0.6秒以上か、偶数である場合 */
                    STSFL0 &= 0xF7;/* アラーム出力中フラグをオフにする */
                    TSB_PC_DATA_PC2 = 0;/* ブザークリア */
                    MXOTN2 &= 0x7F;/* 外部警報出力をクリア */
                    
                } else {
                    /* 0.6秒未満かつ奇数である場合 */
                    STSFL0 |= 0x08;/* アラーム出力中フラグをオンにする */
                    TSB_PC_DATA_PC2 = 1;/* ブザーオン */
                    MXOTN2 |= 0x80;/* 外部警報出力をオン */
                    
                }
                
                if (CCTM5 >= 30) {
                    /* 3秒以上になった場合 */
                    CCTM5 = 0;/* クリアする */
                    
                }
                
            }
            
        } else if (CCSEQ == 12) {
            /* ポンプ停止遅延工程である場合 */
            CCTM2++;/* タイマインクリメント */
            CCTM1++;/* タイマインクリメント */
            
            if (CCTM1 >= 200) {
                /* 20秒経過した場合 */
                MXOTN0 &= 0xF0;/* 常温・低温エジェクタP、常温・低温真空弁をオフにする */
                CCSEQ = 13;/* 真空弁切り替え遅延工程をセット */
                CCTM1 = 0;/* タイマクリア */
                
            }
            
            ABNF &= 0xBF;/* 継続異常の警報アラーム出力をリセット */
            if ((STSFL1 & 0x80) > 0) {
                /* 真空解除中のアラーム出力要求がある場合 */
                CCTM5++;/* インクリメント */
                if ((CCTM5 >= 6) || ((CCTM5 & 0x01) == 0)) {
                    /* 0.6秒以上か、偶数である場合 */
                    STSFL0 &= 0xF7;/* アラーム出力中フラグをオフにする */
                    TSB_PC_DATA_PC2 = 0;/* ブザークリア */
                    MXOTN2 &= 0x7F;/* 外部警報出力をクリア */
                    
                } else {
                    /* 0.6秒未満かつ奇数である場合 */
                    STSFL0 |= 0x08;/* アラーム出力中フラグをオンにする */
                    TSB_PC_DATA_PC2 = 1;/* ブザーオン */
                    MXOTN2 |= 0x80;/* 外部警報出力をオン */
                    
                }
                
                if (CCTM5 >= 30) {
                    /* 3秒以上になった場合 */
                    CCTM5 = 0;/* クリアする */
                    
                }
                
            }
            
        } else if (CCSEQ == 13) {
            /* 真空弁切り替え遅延工程である場合 */
            CCTM2++;/* タイマインクリメント */
            CCTM1++;/* タイマインクリメント */
            
            if (CCTM1 >= 200) {
                /* 20秒経過した場合 */
                CCTM1 = 0;/* タイマーをクリア */
                CCSEQ = 14;/* 真空解除遅延工程をセットする */
                MXOTN0 |= 0x01;/* 常温真空弁をONする */
                
            }
            
            ABNF &= 0xBF;/* 継続異常の警報アラーム出力をリセット */
            if ((STSFL1 & 0x80) > 0) {
                /* 真空解除中のアラーム出力要求がある場合 */
                CCTM5++;/* インクリメント */
                if ((CCTM5 >= 6) || ((CCTM5 & 0x01) == 0)) {
                    /* 0.6秒以上か、偶数である場合 */
                    STSFL0 &= 0xF7;/* アラーム出力中フラグをオフにする */
                    TSB_PC_DATA_PC2 = 0;/* ブザークリア */
                    MXOTN2 &= 0x7F;/* 外部警報出力をクリア */
                    
                } else {
                    /* 0.6秒未満かつ奇数である場合 */
                    STSFL0 |= 0x08;/* アラーム出力中フラグをオンにする */
                    TSB_PC_DATA_PC2 = 1;/* ブザーオン */
                    MXOTN2 |= 0x80;/* 外部警報出力をオン */
                    
                }
                
                if (CCTM5 >= 30) {
                    /* 3秒以上になった場合 */
                    CCTM5 = 0;/* クリアする */
                    
                }
                
            }
            
        } else if (CCSEQ == 14) {
            /* 真空解除遅延工程である場合 */
            CCTM2++;/* インクリメント */
            
            if (CCTM2 >= 700) {
                /* 70秒経過した場合 */
                CCTM2 = 0;/* タイマークリア */
                STSFL1 &= 0x7F;/* 真空解除中のアラーム出力要求フラグをクリア */
                CCSEQ = 15;/* 完了待機工程をセットする */
                CCTM1 = 0;/* タイマクリア */
                
                if ((STSFL0 & 0x80) == 0) {
                    /* 設定モードではない場合 */
                    DSPSEQ = 0;/* ディスプレーシーケンスをクリア */
                    
                }
                
                ABNF &= 0xBF;/* 継続異常の警報アラーム出力をリセット */
                CCTM1++;/* タイマインクリメント */
                if (CCTM1 < 2) {
                    /* タイマが0.2秒未満である場合 */
                    STSFL0 |= 0x08;/* アラーム出力中フラグをオンにする */
                    TSB_PC_DATA_PC2 = 1;/* ブザーオン */
                    MXOTN2 |= 0x80;/* 外部警報出力をオン */
                    
                } else {
                    /* タイマが0.2秒以上である場合 */
                    STSFL0 &= 0xF7;/* アラーム出力中フラグをオフにする */
                    TSB_PC_DATA_PC2 = 0;/* ブザークリア */
                    MXOTN2 &= 0x7F;/* 外部警報出力をクリア */
                    
                    if (CCTM1 >= 3) {
                        /* 0.3秒以上である場合 */
                        CCTM1 = 0;/* クリアする */
                        
                    }
                    
                }
                
            } else {
                /* 70秒経過していない場合 */
                ABNF &= 0xBF;/* 継続異常の警報アラーム出力をリセット */
                if ((STSFL1 & 0x80) > 0) {
                    /* 真空解除中のアラーム出力要求がある場合 */
                    CCTM5++;/* インクリメント */
                    if ((CCTM5 >= 6) || ((CCTM5 & 0x01) == 0)) {
                        /* 0.6秒以上か、偶数である場合 */
                        STSFL0 &= 0xF7;/* アラーム出力中フラグをオフにする */
                        TSB_PC_DATA_PC2 = 0;/* ブザークリア */
                        MXOTN2 &= 0x7F;/* 外部警報出力をクリア */
                        
                    } else {
                        /* 0.6秒未満かつ奇数である場合 */
                        STSFL0 |= 0x08;/* アラーム出力中フラグをオンにする */
                        TSB_PC_DATA_PC2 = 1;/* ブザーオン */
                        MXOTN2 |= 0x80;/* 外部警報出力をオン */
                        
