ASAO-KYOICHI/SVC_RCL_PG/tmpm380_CCONT.c
                    }
                    
                    if (CCTM5 >= 30) {
                        /* 3秒以上になった場合 */
                        CCTM5 = 0;/* クリアする */
                        
                    }
                    
                }
                
            }
            
        } else {
            /* 継続異常の警報アラーム出力 */
            ABNF &= 0xBF;/* 継続異常の警報アラーム出力をリセット */
            CCTM1++;/* タイマインクリメント */
            if (CCTM1 < 2) {
                /* タイマが0.2秒未満である場合 */
                STSFL0 |= 0x08;/* アラーム出力中フラグをオンにする */
                TSB_PC_DATA_PC2 = 1;/* ブザーオン */
                MXOTN2 |= 0x80;/* 外部警報出力をオン */
                
            } else {
                /* タイマが0.2秒以上である場合 */
                STSFL0 &= 0xF7;/* アラーム出力中フラグをオフにする */
                TSB_PC_DATA_PC2 = 0;/* ブザークリア */
                MXOTN2 &= 0x7F;/* 外部警報出力をクリア */
                
                if (CCTM1 >= 3) {
                    /* 0.3秒以上である場合 */
                    CCTM1 = 0;/* クリアする */
                    
                }
                
            }
            
        }
        
    }
    
    /* アプリ抜ける前の処理 */
    if ((STSFL0 & 0x04) > 0) {
        /* 瞬停復帰動作要求フラグがオンである場合 */
        CCTM4++;/* タイマインクリメント */
        if (CCTM4 >= 30) {
            /* 3秒経過した場合 */
            CCTM4 = 0;/* タイマクリア */
            STSFL0 &= 0xFB;/* 瞬停復帰動作要求フラグをオフにする */
            
        } else {
            /* 3秒未満である場合 */
            MXOTN1 &= 0xDF;/* 真空破壊弁をクリア */
            
        }
        
    } else {
        /* 瞬停復帰動作要求フラグがオフである場合 */
        CCTM4 = 0;/* タイマクリア */
        STSFL0 &= 0xFB;/* 瞬停復帰動作要求フラグをオフにする */
        
    }
    
    TSB_PG->DATA = MXOTN0;/* 出力セット */
    
    REG_00 = TSB_PN->DATA;/* データをロード */
    REG_00 &= 0x01;/* 0ビット目のみマスクする */
    REG_00 |= (MXOTN1 & 0xFE);/* 必要なデータをセット */
    TSB_PN->DATA = REG_00;/* 出力セット */
    
    REG_00 = TSB_PC->DATA;/* データをロード */
    REG_00 &= 0x07;/* 0～3ビット目のみマスクする */
    REG_00 |= (MXOTN2 & 0xF8);/* 必要なデータをセット */
    TSB_PC->DATA = REG_00;/* 出力セット */
    
    OS_LoadTime->NEXT_LOAD_Time[3] = 100;/* 次回呼び出し時間 */
    OS_LoadTime->TSK_COND[3] = 0xA0;/* 遅延フラグ建築 */
    
    return;/* 戻る */
}

/**
 *題名：SVCの洗浄工程アプリ
 *作成者：浅尾　享一
 *SVCの洗浄作業を行うアプリケーション
**/
void CCLEAN(void)
{
    uint8_t REG_00 = 0;/* 計算用一時変数 */
    
    if (CCSEQ >= 20) {
        /* 洗浄工程番号が正常である場合 */
        if (CCTM0 >= 10) {
            /* 1秒経過している場合 */
            CCTM0 -= 10;/* 1秒減算 */
            CSEQTS++;/* 秒をインクリメント */
            
            if (CSEQTS >= 60) {
                /* 60秒経過した場合 */
                CSEQTS = 0;/* 秒をクリア */
                CSEQTM++;/* 分をインクリメント */
                
                if (CSEQTM >= 200) {
                    /* 200分経過した場合 */
                    RPAT &= 0xDF;/* 洗浄モードフラグを強制OFF */
                    CCSEQ = 0;/* 冷却シーケンスをクリア */
                    CCTM0 = CCTM1 = CCTM2 = CCTM4 = 0;/* 冷却シーケンスタイマをクリア */
                    CSEQTS = 0;/* 冷却時間をクリア */
                    CSEQTM = 0;/* 冷却時間をクリア */
                    
                    if ((SYSFLG & 0x40) == 0) {
                        /* 電源OFFである場合 */
                        CCTM3 = 0;/* 常温真空弁監視用タイマをクリア */
                        MXOTN0 &= 0xF0;/* 低温常温エジェクタ―Pオフ、低温常温真空弁をオフ */
                        MXOTN1 &= 0x80;/* 真空破壊弁、徐冷弁、低温常温エジェクタ―弁をオフ */
                        MXOTN2 &= 0xAF;/* 熱交循環Pと熱交排水弁をオフ */
                        
                    } else {
                        /* 電源ONである場合 */
                        MXOTN0 &= 0xF1;/* 低温常温エジェクタ―Pオフ、低温真空弁をオフ */
                        MXOTN0 |= 0x01;/* 常温真空弁をオンにする */
                        MXOTN1 &= 0x82;/* 真空破壊弁、徐冷弁、低温常温エジェクタ―弁をオフ */
                        MXOTN1 |= 0x02;/* 冷却槽排水弁（予備）をオン */
                        MXOTN2 &= 0xAF;/* 熱交循環Pと熱交排水弁をオフ */
                        
                    }
                    
                    return;/* ここで戻る */
                    
                }/* 200分未満である場合はここに抜ける */
                
            }/* 1分経過していない場合はここに抜ける */
            
        }/* 1秒経過していない場合はここに抜ける */
        
        MXOTN0 &= 0xF0;/* 低温・常温エジェクタP、低温真空弁をオフ */
        MXOTN1 &= 0x80;/* 真空破壊弁、徐冷弁、低温・常温エジェクタ弁をオフ */
        MXOTN2 &= 0xAF;/* 熱交循環、熱交排水弁をオフ */
        
        if ((ABNF & 0x0F) > 0) {
            /* 異常が発生している場合 */
            return;/* 戻る */
            
        }
        
        REG_00 = CCSEQ;/* シーケンス番号をセット */
        REG_00 -= 20;/* 20を減算 */
        REG_00 &= 0x07;/* マスク */
        
        if ((SYKND0 & 0x10) > 0) {
            /* 蒸気式である場合 */
            REG_00 += 8;
            
        }
        
    } else {
        /* 洗浄工程番号が異常な場合 */
        RPAT &= 0xDF;/* 洗浄モードフラグを強制OFF */
        CCSEQ = 0;/* 冷却シーケンスをクリア */
        CCTM0 = CCTM1 = CCTM2 = CCTM4 = 0;/* 冷却シーケンスタイマをクリア */
        CSEQTS = 0;/* 冷却時間をクリア */
        CSEQTM = 0;/* 冷却時間をクリア */
        
        if ((SYSFLG & 0x40) == 0) {
            /* 電源OFFである場合 */
            CCTM3 = 0;/* 常温真空弁監視用タイマをクリア */
            MXOTN0 &= 0xF0;/* 低温常温エジェクタ―Pオフ、低温常温真空弁をオフ */
            MXOTN1 &= 0x80;/* 真空破壊弁、徐冷弁、低温常温エジェクタ―弁をオフ */
            MXOTN2 &= 0xAF;/* 熱交循環Pと熱交排水弁をオフ */
            
        } else {
            /* 電源ONである場合 */
            MXOTN0 &= 0xF1;/* 低温常温エジェクタ―Pオフ、低温真空弁をオフ */
            MXOTN0 |= 0x01;/* 常温真空弁をオンにする */
            MXOTN1 &= 0x82;/* 真空破壊弁、徐冷弁、低温常温エジェクタ―弁をオフ */
            MXOTN1 |= 0x02;/* 冷却槽排水弁（予備）をオン */
            MXOTN2 &= 0xAF;/* 熱交循環Pと熱交排水弁をオフ */
            
        }
        
        return;/* ここで戻る */
        
    }
    
    /* REG_00 0～7…チラー式の洗浄工程 */
    /* REG_00 8～15…蒸気式の洗浄工程 */
    if (REG_00 == 0) {
        /* 洗浄開始工程 */
        CCTM0 = 0;/* 洗浄工程タイマクリア */
        CSEQTS = 0;/* クリア */
        CSEQTM = 0;/* クリア */
        
        if ((WLOLD & 0x03) == 0x03) {
            /* 常温槽水位が高水位まである場合 */
            CCSEQ = 21;/* 常温槽洗浄工程セットする */
            WCTM1 = WCTM2 = 0;/* 洗浄時のタイマクリア */
            
