ASAO-KYOICHI/SVC_RCL_PG/tmpm380_CCONT.c
            }
            
        } else {
            /* 完了アラーム出力終了ではない場合 */
            if ((CCTM5 & 0x01) == 0) {
                /* ブザーオンのタイミングである場合 */
                TSB_PC_DATA_PC2 = 1;/* ブザーオン */
                MXOTN2 |= 0x80;/* ブザー外部出力オン */
                STSFL0 |= 0x08;/* 完了アラーム出力中をオン */
                
            } else {
                /* ブザーオフのタイミングである場合 */
                TSB_PC_DATA_PC2 = 0;/* ブザーオフ */
                MXOTN2 &= 0x7F;/* ブザー外部出力をクリア */
                STSFL0 &= 0xF7;/* 完了アラーム出力中をクリア */
                
            }
            
        }
        
    } else if (REG_00 == 8) {
        /* 洗浄開始工程(蒸気式) */
        CCTM0 = 0;/* 洗浄工程タイマクリア */
        CSEQTS = 0;/* クリア */
        CSEQTM = 0;/* クリア */
        
        if ((WLOLD & 0x03) == 0x03) {
            /* 常温槽水位が高水位まである場合 */
            CCSEQ = 21;/* 常温槽洗浄工程セットする */
            WCTM1 = WCTM2 = 0;/* 洗浄時のタイマクリア */
            
        }
        
    } else if (REG_00 == 9) {
        /* 常温槽洗浄工程(蒸気式) */
        MXOTN0 |= 0x04;/* 常温エジェクタ―Pをオン */
        MXOTN1 |= 0x04;/* 常温エジェクタ弁をオン */
        
        if (CSEQTM >= 8) {
            /* 熱交排水遅延時間が8分経過した場合 */
            if ((SYKND0 & 0xC0) != 0x80) {
                /* 100R以外である場合 */
                MXOTN2 |= 0x10;/* 熱交排水弁をオン */
                
            }
            
            if (CSEQTM >= 10) {
                /* 熱交排水遅延工程時間が10分経過した場合 */
                MXOTN0 &= 0xF0;/* マスク */
                MXOTN1 &= 0x80;/* マスク */
                
                CCTM0 = 0;/* タイマクリア */
                CSEQTS = 0;
                CSEQTM = 0;
                
                CCSEQ = 22;/* 常温槽の排水工程セット */
                WCTM1 = 0;/* 洗浄時の電動弁動作タイマをクリア */
                
            }
            
        }
        
    } else if (REG_00 == 10) {
        /* 常温槽排水工程(蒸気式) */
        if ((SYKND0 & 0xC0) != 0x80) {
            /* 100R以外である場合 */
            MXOTN2 |= 0x10;/* 熱交排水弁をオン */
            
        }
        
        if (CSEQTM < 5) {
            /* 5分経過していない場合 */
            return;/* 戻る */
            
        }
        
        if ((WLOLD & 0x03) == 0x03) {
            /* 常温槽水槽の水位が高水位まである場合 */
            CCTM0 = 0;/* タイマクリア */
            CSEQTS = 0;
            CSEQTM = 0;
            
            CCSEQ = 23;/* 常温槽のすすぎ工程1セット */
            WCTM1 = WCTM2 = 0;/* 洗浄時の電動弁動作タイマと、洗浄時のエア抜き弁動作タイマをクリア */
            
        }
        
    } else if (REG_00 == 11) {
        /* 常温槽すすぎ1工程(蒸気式) */
        MXOTN0 |= 0x04;/* 常温エジェクタPをセット */
        MXOTN1 |= 0x04;/* 常温エジェクタ弁をセット */
        if ((SYKND0 & 0xC0) != 0x80) {
            /* 100R以外である場合 */
            MXOTN2 |= 0x10;/* 熱交排水弁をセット */
            
        }
        
        if (CSEQTM < 10) {
            /* 10分経過していない場合 */
            return;/* 戻る */
            
        }
        
        MXOTN0 &= 0xF0;/* 出力をマスク */
        MXOTN1 &= 0x80;/* 出力をマスク */
        
        CCTM0 = 0;/* タイマクリア */
        CSEQTS = 0;
        CSEQTM = 0;
        
        CCSEQ = 24;/* 常温槽の排水工程セット */
        WCTM1 = 0;/* 洗浄時の電動弁動作タイマをクリア */
        
    } else if (REG_00 == 12) {
        /* 常温槽排水工程2(蒸気式) */
        if ((SYKND0 & 0xC0) != 0x80) {
            /* 100R以外である場合 */
            MXOTN2 |= 0x10;/* 熱交排水弁をオン */
            
        }
        
        if (CSEQTM < 5) {
            /* 5分経過していない場合 */
            return;/* 戻る */
            
        }
        
        if ((WLOLD & 0x03) == 0x03) {
            /* 常温槽水槽の水位が高水位まである場合 */
            CCTM0 = 0;/* タイマクリア */
            CSEQTS = 0;
            CSEQTM = 0;
            
            CCSEQ = 25;/* 常温槽のすすぎ工程2セット */
            WCTM1 = WCTM2 = 0;/* 洗浄時の電動弁動作タイマと、洗浄時のエア抜き弁動作タイマをクリア */
            
        }
        
    } else if (REG_00 == 13) {
        /* 常温槽すすぎ2工程(蒸気式) */
        MXOTN0 |= 0x04;/* 常温エジェクタPをセット */
        MXOTN1 |= 0x04;/* 常温エジェクタ弁をセット */
        if ((SYKND0 & 0xC0) != 0x80) {
            /* 100R以外である場合 */
            MXOTN2 |= 0x10;/* 熱交排水弁をセット */
            
        }
        
        if (CSEQTM < 10) {
            /* 10分経過していない場合 */
            return;/* 戻る */
            
        }
        
        MXOTN0 &= 0xF0;/* 出力をマスク */
        MXOTN1 &= 0x80;/* 出力をマスク */
        
        CCTM0 = 0;/* タイマクリア */
        CSEQTS = 0;
        CSEQTM = 0;
        
        CCSEQ = 26;/* 排水工程セット */
        WCTM1 = 0;/* 洗浄時の電動弁動作タイマをクリア */
        
    } else if (REG_00 == 14) {
        /* 排水工程 */
        CCTM0 = 0;/* タイマクリア */
        CCTM5 = 0;
        CSEQTS = 0;
        CSEQTM = 0;
        
        CCSEQ = 27;/* 洗浄工程終了をセット */
        WCTM1 = WCTM2 = 0;/* 洗浄時の電動弁動作タイマと、洗浄時のエア抜き弁動作タイマをクリア */
        
    } else if (REG_00 == 15) {
        /* 洗浄工程完了である場合 */
        if (CSEQTM < 5) {
            /* 排水動作が5分経過していない場合 */
            return;/* 戻る */
            
        }
        
        CCTM5++;/* インクリメント */
        if (CCTM5 >= 12) {
            /* 完了アラーム出力終了である場合 */
            if (CCTM5 < 30) {
                /* 完了表示が3秒未満である場合 */
                TSB_PC_DATA_PC2 = 0;/* ブザーオフ */
                MXOTN2 &= 0x7F;/* ブザー外部出力をクリア */
                STSFL0 &= 0xF7;/* 完了アラーム出力中をクリア */
                
            } else {
                /* 完了表示が3秒以上である場合 */
                SYSFLG &= 0xBF;/* 電源フラグをオフ */
                STSFL0 &= 0x7F;/* 設定モードを解除 */
                DSPSEQ = 0;/* 表示シーケンスクリア */
                DSPSSQ = 0;/* 表示サブシーケンスクリア */
                RPAT &= 0xDF;/* 洗浄モードフラグをリセット */
                RPAT |= 0xC0;/* 排水フラグをセット */
                CCSEQ = 0;/* 洗浄工程クリア */
                CSEQTS = 0;/* 秒カウンタクリア */
                CSEQTM = 0;/* 分カウンタクリア */
                WCTM1 = WCTM2 = 0;/* 洗浄時の電動弁動作タイマと、洗浄時のエア抜き弁動作タイマをクリア */
                
                TSB_PC_DATA_PC2 = 0;/* ブザーオフ */
                MXOTN2 &= 0x7F;/* ブザー外部出力をクリア */
                STSFL0 &= 0xF7;/* 完了アラーム出力中をクリア */
                
            }
            
        } else {
            /* 完了アラーム出力終了ではない場合 */
            if ((CCTM5 & 0x01) == 0) {
                /* ブザーオンのタイミングである場合 */
                TSB_PC_DATA_PC2 = 1;/* ブザーオン */
                MXOTN2 |= 0x80;/* ブザー外部出力オン */
                STSFL0 |= 0x08;/* 完了アラーム出力中をオン */
                
            } else {
                /* ブザーオフのタイミングである場合 */
                TSB_PC_DATA_PC2 = 0;/* ブザーオフ */
                MXOTN2 &= 0x7F;/* ブザー外部出力をクリア */
                STSFL0 &= 0xF7;/* 完了アラーム出力中をクリア */
                
            }
            
        }
        
    }
    
    return;
    
}
